package tetris2;

/*-----------------------------------------------
	��TetrisBlock.java
テトリスブロックの管理
-------------------------------------------------*/
import java.util.Random;

class TetrisBlock{
	Random rnd = new Random();
	private int[][] Block;	//ブロックの状態を保持するための変数

	/*-----------------------------------------------
  		7つのブロックをランダムに生成するメソッド
  	-------------------------------------------------*/
	public void createBlock(){
		int n = rnd.nextInt(7);	//ランダムにブロックを生成

		switch(n){
			case 0:
				Block = new int[][]{ {0, 1, 0, 0},
						    	     {0, 1, 0, 0},
						    		 {0, 1, 0, 0},
						    		 {0, 1, 0, 0} };
				break;
			case 1:
				Block = new int[][]{ {0, 0, 0, 0},
				             		 {0, 1, 1, 0},
							 		 {0, 1, 1, 0},
									 {0, 0, 0, 0} };
				break;
			case 2:
				Block = new int[][]{ {0, 0, 0, 0},
							         {0, 1, 1, 0},
							         {1, 1, 0, 0},
							 		 {0, 0, 0, 0} };
				break;
			case 3:
				Block = new int[][]{ {0, 0, 0, 0},
							 		 {1, 1, 0, 0},
									 {0, 1, 1, 0},
									 {0, 0, 0, 0} };
				break;
			case 4:
				Block = new int[][]{ {0, 0, 0, 0},
									 {0, 1, 0, 0},
							 		 {1, 1, 1, 0},
									 {0, 0, 0, 0} };
				break;
			case 5:
				Block = new int[][]{ {0, 1, 0, 0},
							 		 {0, 1, 0, 0},
							 		 {0, 1, 1, 0},
							 		 {0, 0, 0, 0} };
				break;
			default:
				Block = new int[][]{ {0, 0, 1, 0},
							 		 {0, 0, 1, 0},
							 		 {0, 1, 1, 0},
							 		 {0, 0, 0, 0} };
				break;
		}
	}
	/*-----------------------------------------------
  		Blockの値を外部から得るためにメソッドを作成
  	-------------------------------------------------*/
	public int[][] getBlock(){
		return Block;
	}
	/*-----------------------------------------------
  		ブロックを回転させるメソッド
  	-------------------------------------------------*/
	public void rotateBlock(){
		Block = getRotateBlock();
	}
	/*-----------------------------------------------
  		for文でコピー先の配列の左から右、上から下へコピーするメソッド
  		右回転を行うには、コピー元の配列の下から上、左から右へコピーをする
  	-------------------------------------------------*/
	public int[][] getRotateBlock(){
		int[][] tmp = new int[4][4];

		for(int i=0; i<4; i++){
			for(int j=0; j<4; j++){
				tmp[i][j] = Block[3-j][i];
			}
		}
		return tmp;
	}
}